// src/lib/constants.js

// ----------------------------------------------------
// 💡 โค้ดกระชับ: ตัวแปร Array ธรรมดาสำหรับตัวเลือก
// ----------------------------------------------------
export const SECTIONS = [
    'เทคโนโลยีสารสนเทศ',
    'แผนงาน',
    'พัสดุ',
    'บริหาร',
    'การเงิน',
    'บัญชี',
    'ก่อสร้าง',
    'ช่างกล',
    'สำรวจและออกแบบ',
    'ห้องประชุมเล็ก(ชั้น2)',
    'ห้องประชุมใหญ่(ขั้น3)'
];

export const WORK_TYPES = [
    'แก้ไข',
    'ติดตั้ง',
    'ประชุม'
];

export const INITIAL_STATUS = 'ดำเนินการ';